{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2018/12/26/hello-world/"},{"title":"Datawhale Mysql学习日记","text":"背景介绍这次是参加 Datawhale 的组队学习计划。学习计划具体内容如下 【组队学习时间】2月26日 - 3月5日。每天22:00发布作业，第二天的22:00为作业截止期限。 【打卡方式】知识星球小程序打卡，用小程序/网页版/App均可打卡。之后会给大家发知识星球邀请链接。打卡格式：学员编号-任务名称-你写的csdn博客链接 【监督金说明】会收取9.9的报名费，完成任务后会返还8元，剩余1.9元作为优秀learner奖励。 【奖励制度】每次任务中第一个学习分享和作业完成最好的人都会得到奖励 【清退规则】未按时完成任务的学员，将会被清退！！若有强烈意愿再次进群学习，☆需主动联系负责人并且在下次作业提交截止前，补齐两个任务。（注意：仅有一次再进群机会） 来源：Datawhale 新学期组队学习计划 参考资料：SQL必知必会 (豆瓣)(https://book.douban.com/subject/24250054/)、[SQL必知必会 (豆瓣)]()(https://book.douban.com/subject/24250054/) 每日学习任务20190226 软件安装及服务器设置 Mac下安装Mysql 下载 DMG安装包 (https://dev.mysql.com/downloads/mysql/) 安装。注意安装界面会让你设置ROOT密码，后续会用到。 终端连接MySQL ～～～ PATH=”$PATH”:/usr/local/mysql/bin mysql -u root -p ～～～ 教程（注 homebrew安装方法容易失败不建议尝试）： 「MySQL基础」Day1 软件安装与数据库基础 | Wind Track(https://windtrack.xyz/post/1015fd1e/) mac安装mysql的两种方法（含配置） - 简书(https://www.jianshu.com/p/fd3aae701db9) 使用图形界面软件 Navicat for SQL (https://www.navicat.com.cn/products) 数据库基础知识 数据库定义 电子邮件地址簿、因特网搜索站点、自动取款机上使用ATM卡，这些日常生活中，我们习以为常的行为，背后都有着数据库的影子。数据库是一个以某种有组织的方式存储的数据集合。数据库是通过DBMS（数据管理系统）创建和操纵的容器。 关系型数据库 表 表（table） 某种特定类型数据的结构化清表具有一些特性，这些特性定义了数据在表中如何存储，如可以存储什么样的数据，数据如何分解，各部分信息如何命名，等等。描述表的这组信息就是所谓的模式，模式可以用来描述数据库中特定的表以及整个数据库（和其中表的关系） 行 行（row） 表中的一个记录 列 列（column） 表中的一个字段。所有表都是由一个或多个列组成的。数据库中每个列都有相应的数据类型。数据类型定义列可以存储的数据种类。 主键 唯一标识表中每行的这个列（或这组列）称为主键。主键用来表示一个特定的行任意两行都不具有相同的主键值； 每个行都必须具有一个主键值（主键列不允许NULL值） 。主键通常定义在表的一列上，但这并不是必需的，也可以一起使用多个列作为主键。 外键 表的外键是另一表的主键, 外键可以有重复的, 可以是空值用来和其他表建立联系用的一个表可以有多个外键 数据库管理系统 DBMS可分为两类：一类为基于共享文件系统的DBMS，另一类为基于客户机—服务器的DBMS。 前者 （包括诸如Microsoft Access和FileMaker）用于桌面用途，通常不用于高端或更关键的应用。MySQL、Oracle以及Microsoft SQL Server等数据库是基于客户机—服务器的数据库。 客户机—服务器应用分为两个不同的部分。服务器部分是负责所有数据访问和处理的一个软件。这个软件运行在称为数据库服务器的计算机上","link":"/2019/02/25/Datawhale-Mysql学习日记/"},{"title":"record","text":"There is a collection and record of experience about Bertelsmann Data Science Scholarship Program | Udacity 1. 2018/3/28I applied the Scholarship. 2. 2018/5/3I got the message that I was accepted into the Bertelsmann Data Science Scholarship program. 3. 2018/5/9I beagn the learning of challenge courses. 4. 2018/8/9The phase 1 was end. I was waiting the result that decide me whether accepted in to phase 2 or not.From the phase 1, I relearned the knowledge about statistics and Python. Besides, I acuqired the skill about SQL. 2018/8/25 I got the message that I earned a full Nanodegree scholarship to Phase 2 of the Bertelsmann Data Science Scholarship! 6. 2018/9/3I beagn my postgraudate experience in Beijing National Accounting Insitution. I major in taxation. 7. 2018/9/7I felt frustrated when I knew I was assigned to the Data Foundation.I want to learn the knowledge about Business Analysis or Data Analysis. I want to learn more data science knowlege.I want to learn more knowledge to survive in the rapid change age.From slack, I knew that someone change their track after completing Data Foundation.So I began the learning of Data Foundation.But I felt I was too positive about my learning plan. I forgot to consider things from my school. I have been occupied by the course most of the day. Outside of class, I still need to do a lot of homework. Even so, I am still studying hard. 8. 2018/9/11I completed the Intro​project called Interpret​a​Data​Visualization​. My answer :Interpret​a​Data​Visualization​by shikunxia 9. 2018/10/10I completed the project called Analyze Survey Data. My materiel： Note- Analyze Survey Data by shikunxia PPT- Analyze Survey Data by shikunxia Data- Analyze Survey Data by shikunxia Project- Analyze Survey Data by shikunxia 10. 2019/11/6I completed the project called Query a Digital Music Store Database. After my first submit, I got a modifition suggestion.The sugeestions are deliberate. I felt thankful for Udacity reviewer. My materiel： Code- Query a Digital Music Store Database by shikunxia Data- Query a Digital Music Store Database by shikunxia Notes-Query a Digital Music Store Database by shikunxia PPT- Query a Digital Music Store Database by shikunxia 11. 2018/12/3I completed the project called Build Data Dashboards .My materials: Notes-Build Data Dashboards by shikunxia Project-Build Data Dashboards about Youtube with by shikunxia 12. 2018/12/4I graduated, I got the certificate. ResourceSyllabus Syllabus-DataFoundationsNanodegree Syllabus-BusinessAnalystNanodegree Syllabus-DataAnalystNanodegree Learning MaterialsSQL Solve SQL HackerRank Problems - LeetCode Video Introduction to SQL DB5 Courseware | Stanford Lagunita SQL必知必会 (豆瓣) SELECT基础知识 - SQLZOO Data Visulation Chart Dos and Don’ts - Data Visualization - LibGuides at Duke University Cole Nussbaumer Knaflic: “Storytelling with Data” \\ Talks at Google - YouTube How-to-Lie-with-Statistics The Visual Display of Quantitative Information (豆瓣) Notes: Beacuse I am a student form China. The notes and resources from are multilingual.","link":"/2018/12/26/record/"},{"title":"安永税务精英大赛托业考试随记","text":"个人情况 英语阅读可以，听力十分渣。 CET-6 556 这次参加考试695/990，阅读435，听力265 托业常识题型和分值 分数换算 需要注意的地方 自带耳机 听力和阅读考试时间分开计算，听力提前完成所空出的时间不会加计入到阅读的时间 可以提前交卷 做完就会知道自己成绩 听力考试时不能查看前后翻阅题目 一个题目答完后不可以再回到该题目 每个 part 的题目介绍录音可以直接跳过 不可以标记题目 总共45分钟 阅读 可以标记题目 总共75分钟 总结的经验+资料推荐 备考模式：先问问身边同学，然后自己再试一试，接着 资源链接:https://pan.baidu.com/s/12xgsVe69dTTTt2K52w-r3g 密码:l0gr 听力不好应该多花时间在听力上 练习【必做】新托业全真题库 俗称跨栏（从考场带出或退休的以往真题 虽不会再考但真题值得深究 争议bug题很少） 练习19天听力考试必见500句","link":"/2018/12/29/安永税务精英大赛托业考试随记/"}],"tags":[],"categories":[]}