{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2018/12/26/hello-world/"},{"title":"record","text":"1. 2018/3/28I applied the Scholarship. 2. 2018/5/3I got the message that I was accepted into the Bertelsmann Data Science Scholarship program. 3. 2018/5/9I beagn the learning of challenge courses. 4. 2018/8/9The phase 1 was end. I was waiting the result that decide me whether accepted in to phase 2 or not.From the phase 1, I relearned the knowledge about statistics and Python. Besides, I acuqired the skill about SQL. 2018/8/25 I got the message that I earned a full Nanodegree scholarship to Phase 2 of the Bertelsmann Data Science Scholarship! 6. 2018/9/3I beagn my postgraudate experience in Beijing National Accounting Insitution. I major in taxation. 7. 2018/9/7I felt frustrated when I knew I was assigned to the Data Foundation.I want to learn the knowledge about Business Analysis or Data Analysis. I want to learn more data science knowlege.I want to learn more knowledge to survive in the rapid change age.From slack, I knew that someone change their track after completing Data Foundation.So I began the learning of Data Foundation.But I felt I was too positive about my learning plan. I forgot to consider things from my school. I have been occupied by the course most of the day. Outside of class, I still need to do a lot of homework. Even so, I am still studying hard. 8. 2018/9/11I completed the Intro​project called Interpret​a​Data​Visualization​. My answer :Interpret​a​Data​Visualization​by shikunxia 9. 2018/10/10I completed the project called Analyze Survey Data. My materiel： Note- Analyze Survey Data by shikunxia PPT- Analyze Survey Data by shikunxia Data- Analyze Survey Data by shikunxia Project- Analyze Survey Data by shikunxia 10. 2019/11/6I completed the project called Query a Digital Music Store Database. After my first submit, I got a modifition suggestion.The sugeestions are deliberate. I felt thankful for Udacity reviewer. My materiel： Code- Query a Digital Music Store Database by shikunxia Data- Query a Digital Music Store Database by shikunxia Notes-Query a Digital Music Store Database by shikunxia PPT- Query a Digital Music Store Database by shikunxia 11. 2018/12/3I completed the project called Build Data Dashboards .My materials: Notes-Build Data Dashboards by shikunxia Project-Build Data Dashboards about Youtube with by shikunxia 12. 2018/12/4I graduated, I got the certificate. ResourceSyllabus Syllabus-DataFoundationsNanodegree Syllabus-BusinessAnalystNanodegree Syllabus-DataAnalystNanodegree Learning MaterialsSQL Solve SQL HackerRank Problems - LeetCode Video Introduction to SQL DB5 Courseware | Stanford Lagunita SQL必知必会 (豆瓣) SELECT基础知识 - SQLZOO Data Visulation Chart Dos and Don’ts - Data Visualization - LibGuides at Duke University Cole Nussbaumer Knaflic: “Storytelling with Data” \\ Talks at Google - YouTube How-to-Lie-with-Statistics The Visual Display of Quantitative Information (豆瓣) Notes: Beacuse I am a student form China. The notes and resources from are multilingual.","link":"/2018/12/26/record/"}],"tags":[],"categories":[]}